ws-asahi/WazamonoCore/megaavr/variants/20pin-duseries/pins_arduino.h
        /*##  #   #  ###  #     ###   ###      ####  ### #   #  ###
        #   # ##  # #   # #    #   # #         #   #  #  ##  # #
        ##### # # # ##### #    #   # #  ##     ####   #  # # #  ###
        #   # #  ## #   # #    #   # #   #     #      #  #  ##     #
        #   # #   # #   # ####  ###   ###      #     ### #   #  #*/


#define PIN_A0             (NOT_A_PIN)
#define PIN_A1             (NOT_A_PIN)
#define PIN_A2             (NOT_A_PIN)
#define PIN_A3             (NOT_A_PIN)
#define PIN_A4             (PIN_PD4)
#define PIN_A5             (PIN_PD5)
#define PIN_A6             (PIN_PD6)
#define PIN_A7             (PIN_PD7)
#define PIN_A8             (NOT_A_PIN)
#define PIN_A9             (NOT_A_PIN)
#define PIN_A10            (NOT_A_PIN)
#define PIN_A11            (NOT_A_PIN)
#define PIN_A12            (NOT_A_PIN)
#define PIN_A13            (NOT_A_PIN)
#define PIN_A14            (NOT_A_PIN)
#define PIN_A15            (NOT_A_PIN)
#define PIN_A16            (NOT_A_PIN)
#define PIN_A17            (NOT_A_PIN)
#define PIN_A18            (NOT_A_PIN)
#define PIN_A19            (NOT_A_PIN)
#define PIN_A20            (NOT_A_PIN)
#define PIN_A21            (NOT_A_PIN)
/* No ADC on               PIN_PF6 (reset) */
/* No ADC on               PIN_PF7 (UPDI) */
/* No ADC on               PIN_PA0 (XTAL1) */
/* No ADC on               PIN_PA1 (XTAL2) */
#define PIN_A22            (PIN_PA2)
#define PIN_A23            (PIN_PA3)
#define PIN_A24            (PIN_PA4)
#define PIN_A25            (PIN_PA5)
#define PIN_A26            (PIN_PA6)
#define PIN_A27            (PIN_PA7)
#define PIN_A28            (NOT_A_PIN)
#define PIN_A29            (NOT_A_PIN)
#define PIN_A30            (NOT_A_PIN)
#define PIN_A31            (PIN_PC3)

static const uint8_t A0  = NOT_A_PIN;
static const uint8_t A1  = NOT_A_PIN;
static const uint8_t A2  = NOT_A_PIN;
static const uint8_t A3  = NOT_A_PIN;
static const uint8_t A4  = PIN_A4;
static const uint8_t A5  = PIN_A5;
static const uint8_t A6  = PIN_A6;
static const uint8_t A7  = PIN_A7;
static const uint8_t A8  = NOT_A_PIN; // No PORTE
static const uint8_t A9  = NOT_A_PIN;
static const uint8_t A10 = NOT_A_PIN;
static const uint8_t A11 = NOT_A_PIN;
static const uint8_t A12 = NOT_A_PIN;
static const uint8_t A13 = NOT_A_PIN;
static const uint8_t A14 = NOT_A_PIN;
static const uint8_t A15 = NOT_A_PIN;
static const uint8_t A16 = NOT_A_PIN; // PF0
static const uint8_t A17 = NOT_A_PIN;
static const uint8_t A18 = NOT_A_PIN;
static const uint8_t A19 = NOT_A_PIN;
static const uint8_t A20 = NOT_A_PIN;
static const uint8_t A21 = NOT_A_PIN;
static const uint8_t A22 = PIN_A22; // PORTA starting at PA2 - skips the two crystal pins.
static const uint8_t A23 = PIN_A23;
static const uint8_t A24 = PIN_A24;
static const uint8_t A25 = PIN_A25;
static const uint8_t A26 = PIN_A26;
static const uint8_t A27 = PIN_A27;
static const uint8_t A28 = NOT_A_PIN; // PORTC
static const uint8_t A29 = NOT_A_PIN;
static const uint8_t A30 = NOT_A_PIN;
static const uint8_t A31 = PIN_A31;

#define AIN4               ADC_CH(4)
#define AIN5               ADC_CH(5)
#define AIN6               ADC_CH(6)
#define AIN7               ADC_CH(7)
#define AIN22              ADC_CH(22)
#define AIN23              ADC_CH(23)
#define AIN24              ADC_CH(24)
#define AIN25              ADC_CH(25)
#define AIN26              ADC_CH(26)
#define AIN27              ADC_CH(27)
#define AIN31              ADC_CH(31)



        /*##  ### #   #      ###  ####  ####   ###  #   #  ###
        #   #  #  ##  #     #   # #   # #   # #   #  # #  #
        ####   #  # # #     ##### ####  ####  #####   #    ###
        #      #  #  ##     #   # #  #  #  #  #   #   #       #
        #     ### #   #     #   # #   # #   # #   #   #    #*/

#ifdef ARDUINO_MAIN
  // These need to be defined in one and only one place.
  const uint8_t digital_pin_to_port[] = {
    PA,         //  0 PA0/USART0_Tx/CLKIN
    PA,         //  1 PA1/USART0_Rx
    PA,         //  2 PA2/SDA
    PA,         //  3 PA3/SCL
    PA,         //  4 PA4/MOSI
    PA,         //  5 PA5/MISO
    PA,         //  6 PA6/SCK
    PA,         //  7 PA7/SS/CLKOUT/LED_BUILTIN
    NOT_A_PORT, //  8 PC0 NOT A PIN // Nothing depends on this
    NOT_A_PORT, //  9 PC1/USART1_Rx/TCA0 PWM
    NOT_A_PORT, // 10 PC2/TCA0 PWM
    PC,         // 11 PC3/TCA0 PWM
    PD,         // We give PD0 a number and specify it as being on PORTD because things depend on that because it is the zero pin and the origin of the analog inputs.
    NOT_A_PORT, // 13 PD1/AIN1
    NOT_A_PORT, // 14 PD2/AIN2
    NOT_A_PORT, // 15 PD3/AINN
    PD,         // 16 PD4/AIN4
    PD,         // 17 PD5/AIN5
    PD,         // 18 PD6/AIN6
    PD,         // 19 PD7/AIN7/AREF
    PF,         // 26 PF6 RESET
    PF          // 27 PF7 UPDI
  };

  /* Use this for accessing PINnCTRL register */
  const uint8_t digital_pin_to_bit_position[] = { // *INDENT-OFF*
    #if ((CLOCK_SOURCE & 0x03) == 0) // PA0 used for external clock and crystal.
      PIN0_bp,//   0 PA0
    #else
      NOT_A_PIN,
    #endif
    #if ((CLOCK_SOURCE & 0x03) == 1)   // PA1 also used for crystal
      NOT_A_PIN,
    #else // PA1 used for external crystal.
      PIN1_bp,//   1 PA1
    #endif    // *INDENT-ON*
    PIN2_bp,   //  2 PA2/SDA
    PIN3_bp,   //  3 PA3/SCL
    PIN4_bp,   //  4 PA4/MOSI
    PIN5_bp,   //  5 PA5/MISO
    PIN6_bp,   //  6 PA6/SCK
    PIN7_bp,   //  7 PA7/SS/CLKOUT/LED_BUILTIN
    NOT_A_PIN, //  USB
    NOT_A_PIN, //  USB
    NOT_A_PIN, //  USB
    PIN3_bp,   // 11 PC3
    NOT_A_PIN, // 12
    NOT_A_PIN, // 13
    NOT_A_PIN, // 14
    NOT_A_PIN, // 15
    PIN4_bp,   // 16 PD4/AIN4
    PIN5_bp,   // 17 PD5/AIN5
    PIN6_bp,   // 18 PD6/AIN6
    PIN7_bp,   // 19 PD7/AIN7/AREF
    PIN6_bp,   // 26 PF6 RESET
    PIN7_bp    // 27 PF7 UPDI
  };

  const uint8_t digital_pin_to_bit_mask[] = { // *INDENT-OFF*
    #if ((CLOCK_SOURCE & 0x03) == 0) // PA0 used for external clock and crystal.
      PIN0_bm,//   0 PA0
    #else
      NOT_A_PIN,
    #endif
    #if ((CLOCK_SOURCE & 0x03) == 1)   // PA1 also used for crystal
      NOT_A_PIN,
    #else // PA1 used for external crystal.
      PIN1_bm,//   1 PA1
    #endif    // *INDENT-ON*
    PIN2_bm,   //  2 PA2/SDA
    PIN3_bm,   //  3 PA3/SCL
    PIN4_bm,   //  4 PA4/MOSI
    PIN5_bm,   //  5 PA5/MISO
    PIN6_bm,   //  6 PA6/SCK
    PIN7_bm,   //  7 PA7/SS/CLKOUT/LED_BUILTIN
    NOT_A_PIN, //  USB
    NOT_A_PIN, //  USB
    NOT_A_PIN, //  USB
    PIN3_bm,   // 11 PC3
    NOT_A_PIN, // 12 PD0 NOT_A_PIN
    NOT_A_PIN, // 13 PD1 NOT_A_PIN
    NOT_A_PIN, // 14 PD2 NOT_A_PIN
    NOT_A_PIN, // 15 PD3 NOT_A_PIN
    PIN4_bm,   // 16 PD4/AIN4
    PIN5_bm,   // 17 PD5/AIN5
    PIN6_bm,   // 18 PD6/AIN6
    PIN7_bm,   // 19 PD7/AIN7/AREF
    PIN6_bm,   // 26 PF6 RESET
    PIN7_bm    // 27 PF7 UPDI
  };


  const uint8_t digital_pin_to_timer[] = {
    NOT_ON_TIMER, //  0 PA0 TCA0 WO0 h/w default (not our default)
    NOT_ON_TIMER, //  1 PA1 TCA0 WO1 h/w default (not our default)
    TIMERB0,      //  2 PA2 TCA0 WO2 h/w default (not our default)
    TIMERB1,      //  3 PA3 TCA0 WO3 h/w default (not our default)
    NOT_ON_TIMER, //  4 PA4 TCA0 WO4 h/w default (not our default)
    NOT_ON_TIMER, //  5 PA5 TCA0 WO5 h/w default (not our default)
    NOT_ON_TIMER, //  6 PA6
    NOT_ON_TIMER, //  7 PA7
    NOT_ON_TIMER, //  8  USB
    NOT_ON_TIMER, //  9  USB
    NOT_ON_TIMER, // 10  USB
    NOT_ON_TIMER, // 11 PC3 TCA0 ALT2
    NOT_ON_TIMER, // 16 PD4 TCA0 ALT3
    NOT_ON_TIMER, // 17 PD5 TCA0 ALT3
    NOT_ON_TIMER, // 18 PD6 DAC0 output
    NOT_ON_TIMER, // 19 PD7
    NOT_ON_TIMER, // 26 PF6 RESET
    NOT_ON_TIMER  // 27 PF7 UPDI
  };

  #endif

